org/uses_this.org
#+TITLE: Uses This

* Hardware
Since I travel a lot my setup is optimised for portability.

- 16" Macbook M2 Max: The beast
- Samsung 23 Ultra
- Samsung Watch 5 Pro
- Bose Wireless Headphones
- JBP Portable Clip 4

* Software
As much as possible I do everything in Emacs. My (rather outdated) dotfiles can be found [[https://github.com/geoffwalmsley/dotemacs][here]]
I've developed a few custom emacs tools including a major mode for coding in chialisp.

All of my writing is done using org-mode. I've tried to use org-roam as a knowledge management system but found it a bit rough and quite difficult to maintain. So now I just keep two org files with capture templates for notes and journalling and search those files when I want to recover something.
