html/uses_this.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<meta name="description" content="agg_sig_me">
<link rel="stylesheet" href="css/tufte.css" type="text/css" />
</head>
<body>
<div id="body"><div id="container"><div id="navigation"><a href="index.html">Home</a> · <a href="about.html">About</a> · <a href="uses_this.html">Uses This</a></div><div id="content"><article><h1 class="title">Uses This</h1>
<section></section>

<section><h2>Hardware</h2>
<p>
Since I travel a lot my setup is optimised for portability.
</p>

<ul class="org-ul">
<li>16" Macbook M2 Max: The beast</li>
<li>Samsung 23 Ultra</li>
<li>Samsung Watch 5 Pro</li>
<li>Bose Wireless Headphones</li>
<li>JBP Portable Clip 4</li>
</ul>
</section>

<section><h2>Software</h2>
<p>
As much as possible I do everything in Emacs. My (rather outdated) dotfiles can be found <a href="https://github.com/geoffwalmsley/dotemacs">here</a>
I've developed a few custom emacs tools including a major mode for coding in chialisp.
</p>

<p>
All of my writing is done using org-mode. I've tried to use org-roam as a knowledge management system but found it a bit rough and quite difficult to maintain. So now I just keep two org files with capture templates for notes and journalling and search those files when I want to recover something.
</p>
</section>
